Revit 2024 API
ParameterTypeId.RbsPipeInnerDiamParam Property
 "Inside Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RbsPipeInnerDiamParam { get; }
Visual Basic
Public Shared ReadOnly Property RbsPipeInnerDiamParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RbsPipeInnerDiamParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace